src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:ss="http://soapwebapp.com/soap-web-app">
				
		<soapenv:Header></soapenv:Header>
		<soapenv:Body>
			<ss:getStateRequest>
				<ss:name>California</ss:name>
			</ss:getStateRequest>
		
		</soapenv:Body>
				
</soapenv:Envelope>